from src.logger import loggingg
from src.utils import writes

logger = loggingg()


def find_word(data_base: list, need_to_find_word: str) -> list:
    """Поиск по строке в категории или описании"""
    endd = []
    for data in data_base:
        if need_to_find_word in data["Категория"] and data["Описание"].endswith("."):
            endd.append(data)
    writes("results.json", endd)
    return endd


operations = [
    {
        "Дата операции": "10.05.2018 15:49:58",
        "Дата платежа": "12.05.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -10.0,
        "Валюта операции": "TRY",
        "Сумма платежа": -150.18,
        "Валюта платежа": "RUB",
        "Кэшбэк": "nan",
        "Категория": "Отели",
        "MCC": 7011.0,
        "Описание": "Sbc Otel.Tur Gida Ins.Taa",
        "Бонусы (включая кэшбэк)": 3,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 150.18,
    },
    {
        "Дата операции": "10.05.2018 15:04:24",
        "Дата платежа": "11.05.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -28.75,
        "Валюта операции": "TRY",
        "Сумма платежа": -430.58,
        "Валюта платежа": "RUB",
        "Кэшбэк": "nan",
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "McDonald's",
        "Бонусы (включая кэшбэк)": 8,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 430.58,
    },
    {
        "Дата операции": "10.05.2018 14:49:30",
        "Дата платежа": "11.05.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -16.21,
        "Валюта операции": "TRY",
        "Сумма платежа": -242.99,
        "Валюта платежа": "RUB",
        "Кэшбэк": "nan",
        "Категория": "Супермаркеты",
        "MCC": 5411.0,
        "Описание": "Side Carsi Mjet",
        "Бонусы (включая кэшбэк)": 4,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 242.99,
    },
    {
        "Дата операции": "10.05.2018 03:11:53",
        "Дата платежа": "12.05.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -1482.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -1482.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "nan",
        "Категория": "Транспорт",
        "MCC": 4121.0,
        "Описание": "Яндекс Такси",
        "Бонусы (включая кэшбэк)": 29,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 1482.0,
    },
    {
        "Дата операции": "09.05.2018 21:15:41",
        "Дата платежа": "11.05.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -285.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -285.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "nan",
        "Категория": "Супермаркеты",
        "MCC": 5499.0,
        "Описание": "IP Muradyan",
        "Бонусы (включая кэшбэк)": 5,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 285.0,
    },
    {
        "Дата операции": "09.05.2018 13:55:13",
        "Дата платежа": "11.05.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -145.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -145.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "nan",
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "McDonald's",
        "Бонусы (включая кэшбэк)": 2,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 145.0,
    },
    {
        "Дата операции": "09.05.2018 13:44:00",
        "Дата платежа": "11.05.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -328.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -328.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "nan",
        "Категория": "Фастфуд",
        "MCC": 5814.0,
        "Описание": "McDonald's",
        "Бонусы (включая кэшбэк)": 6,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 328.0,
    },
    {
        "Дата операции": "09.05.2018 13:38:54",
        "Дата платежа": "09.05.2018",
        "Номер карты": "*4556",
        "Статус": "OK",
        "Сумма операции": 164.0,
        "Валюта операции": "RUB",
        "Сумма платежа": 164.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "nan",
        "Категория": "Переводы",
        "MCC": "nan",
        "Описание": "Пополнение счета",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 164.0,
    },
]


def services(operations: list) -> dict:
    which_word = input("Введите запрос: ").capitalize()
    end = {which_word: find_word(operations, which_word)}
    writes("services.json", end)
    print(end)
    return end
